---
kind: property
id: P:Autodesk.Revit.DB.CurveByPoints.ReferenceType
source: html/2b1f00e4-a085-9b4d-7a7b-c16fd66b99b4.htm
---
# Autodesk.Revit.DB.CurveByPoints.ReferenceType Property

Indicates the type of reference.

## Syntax (C#)
```csharp
public ReferenceType ReferenceType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when argument is out of range.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when regeneration failed.